//Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
Console.WriteLine("Введите число: ");

Console.WriteLine( Math.Pow(Convert.ToInt32(Console.ReadLine()), 3));
